import sys
import os
sys.path.insert(0, os.path.abspath(os.path.join(os.path.dirname(__file__), '..')))
import pytest
from TamilSandhi.rules.vallinam_addition import VA_Rule_1, VA_Rule_2, VA_Rule_3, VA_Rule_4, VA_Rule_5, VA_Rule_6, VA_Rule_7, VA_Rule_8, VA_Rule_9, VA_Rule_10, VA_Rule_11, VA_Rule_12

@pytest.mark.parametrize("wordPairList, expected", [
    ([u"அ",u"மாணவர்"], [u"அ", u"மாணவர்"]),
    ([u"அ",u"செல்வம்"], [u"அச்",u"செல்வம்"]),
    ([u"இ",u"தகரம்"], [u"இத்", u"தகரம்"]),
    ([u"இ",u"நகரம்"], [u"இ",u"நகரம்"]),
    ([u"எ",u"வரவு"], [u"எ", u"வரவு"]),
    ([u"எ",u"காரணம்"], [u"எக்",u"காரணம்"]),
    ([u"அந்த",u"பையன்"], [u"அந்தப்",u"பையன்"]),
    ([u"அந்த",u"யாத்திரை"], [u"அந்த",u"யாத்திரை"]),
    ([u"இந்த",u"சின்னம்"], [u"இந்தச்",u"சின்னம்"]),
    ([u"இந்த",u"ரத்தினம்"], [u"இந்த",u"ரத்தினம்"]),
    ([u"எந்த",u"கன்னம்"], [u"எந்தக்",u"கன்னம்"]),
    ([u"எந்த",u"நொடி?"], [u"எந்த",u"நொடி?"]),
    ([u"அங்கு",u"தேடினான்"], [u"அங்குத்",u"தேடினான்"]),
    ([u"அங்கு",u"முகர்ந்தான்"], [u"அங்கு",u"முகர்ந்தான்"]),
    ([u"இங்கு",u"பார்"], [u"இங்குப்",u"பார்"]),
    ([u"இங்கு",u"வா"], [u"இங்கு",u"வா"]),
    ([u"எங்கு",u"சென்றாய்?"], [u"எங்குச்",u"சென்றாய்?"]),
    ([u"எங்கு",u"மாண்டான்?"], [u"எங்கு",u"மாண்டான்?"]),
    ([u"ஆங்கு",u"தேடினான்"], [u"ஆங்குத்",u"தேடினான்"]),
    ([u"ஆங்கு",u"முகர்ந்தான்"], [u"ஆங்கு",u"முகர்ந்தான்"]),
    ([u"ஈங்கு",u"பார்"], [u"ஈங்குப்",u"பார்"]),
    ([u"ஈங்கு",u"வா"], [u"ஈங்கு",u"வா"]),
    ([u"யாங்கு",u"சென்றாய்?"], [u"யாங்குச்",u"சென்றாய்?"]),
    ([u"யாங்கு",u"மாண்டான்?"], [u"யாங்கு",u"மாண்டான்?"]),
    ([u"அப்படி",u"செய்தான்"], [u"அப்படிச்",u"செய்தான்"]),
    ([u"அப்படி",u"இகழாதே"], [u"அப்படி",u"இகழாதே"]),
    ([u"இப்படி",u"பின்னாதே"], [u"இப்படிப்",u"பின்னாதே"]),
    ([u"இப்படி",u"நகர்ந்தது"], [u"இப்படி",u"நகர்ந்தது"]),
    ([u"எப்படி",u"கவர்ந்தாள்?"], [u"எப்படிக்",u"கவர்ந்தாள்?"]),
    ([u"எப்படி",u"இடிந்தது?"], [u"எப்படி",u"இடிந்தது?"]),
    ([u"ஆண்டு",u"போகிறார்"], [u"ஆண்டுப்",u"போகிறார்"]),
    ([u"ஆண்டு",u"விட்டான்"], [u"ஆண்டு",u"விட்டான்"]),
    ([u"ஈண்டு",u"சிவந்தது"], [u"ஈண்டுச்",u"சிவந்தது"]),
    ([u"ஈண்டு",u"நிற்கிறார்"], [u"ஈண்டு",u"நிற்கிறார்"]),
    ([u"யாண்டு",u"தகர்ந்தது"], [u"யாண்டுத்",u"தகர்ந்தது"]),
    ([u"யாண்டு",u"நின்றார்?"], [u"யாண்டு",u"நின்றார்?"]),
    ([u"அவ்வகை",u"காகிதம்"], [u"அவ்வகைக்",u"காகிதம்"]),
    ([u"அவ்வகை",u"மிட்டாய்"], [u"அவ்வகை",u"மிட்டாய்"]),
    ([u"இவ்வகை",u"பாத்திரம்"], [u"இவ்வகைப்",u"பாத்திரம்"]),
    ([u"இவ்வகை",u"முத்து"], [u"இவ்வகை",u"முத்து"]),
    ([u"எவ்வகை",u"சுதந்திரம்?"], [u"எவ்வகைச்",u"சுதந்திரம்?"]),
    ([u"எவ்வகை",u"நாடகம்?"], [u"எவ்வகை",u"நாடகம்?"]),
    ([u"இனி",u"பிரியாதே"], [u"இனிப்",u"பிரியாதே"]),
    ([u"இனி",u"வராதே"], [u"இனி",u"வராதே"]),
    ([u"தனி",u"குடும்பம்"], [u"தனிக்",u"குடும்பம்"]),
    ([u"தனி",u"விடுதி"], [u"தனி",u"விடுதி"]),
    ([u"அன்றி",u"கவராதே"], [u"அன்றிக்",u"கவராதே"]),
    ([u"அன்றி",u"வராதே"], [u"அன்றி",u"வராதே"]),
    ([u"இன்றி",u"சிரிப்பாள்"], [u"இன்றிச்",u"சிரிப்பாள்"]),
    ([u"இன்றி",u"விதைப்பான்"], [u"இன்றி",u"விதைப்பான்"]),
    ([u"மற்ற",u"பிள்ளைகள்"], [u"மற்றப்",u"பிள்ளைகள்"]),
    ([u"மற்ற",u"மாநிலம்"], [u"மற்ற",u"மாநிலம்"]),
    ([u"மற்றை",u"சாதனம்"], [u"மற்றைச்",u"சாதனம்"]),
    ([u"மற்றை",u"விவாதம்"], [u"மற்றை",u"விவாதம்"]),
    ([u"அரை",u"ஓவியம்"], [u"அரை",u"ஓவியம்"]),
    ([u"அரை",u"சிற்பம்"], [u"அரைச்",u"சிற்பம்"]),
    ([u"பாதி",u"துணி"], [u"பாதித்",u"துணி"]),
    ([u"பாதி",u"மாநகரம்"], [u"பாதி",u"மாநகரம்"]),
])
def test_va_rule_1_cases(wordPairList, expected):
    assert VA_Rule_1(wordPairList) == expected

@pytest.mark.parametrize("wordPairList2, expected2", [
    ([u"பாக்கு",u"தோப்பு"], [u"பாக்குத்", u"தோப்பு"]),
    ([u"செக்கு",u"மரம்"], [u"செக்கு",u"மரம்"]),
    ([u"செத்து",u"பிழைத்தான்"], [u"செத்துப்", u"பிழைத்தான்"]),
    ([u"செத்து",u"மிதந்தது"], [u"செத்து",u"மிதந்தது"]),
    ([u"தச்சு",u"தொழில்"], [u"தச்சுத்",u"தொழில்"]),
    ([u"அச்சு",u"இயந்திரம்"], [u"அச்சு",u"இயந்திரம்"]),
    ([u"உப்பு",u"கடை"], [u"உப்புக்",u"கடை"]),
    ([u"காப்பு",u"அணிந்தாள்"], [u"காப்பு",u"அணிந்தாள்"])
])

def test_va_rule_2_cases(wordPairList2, expected2):
    assert VA_Rule_2(wordPairList2) == expected2

@pytest.mark.parametrize("wordPairList3, expected3", [
    ([u"பொது",u"தேர்வு"], [u"பொதுத்", u"தேர்வு"]),
    ([u"பொது",u"மக்கள்"], [u"பொது", u"மக்கள்"]),
    ([u"விழு",u"பொருள்"], [u"விழுப்",u"பொருள்"]),
    ([u"புது",u"மருந்து"], [u"புது",u"மருந்து"]),
    ([u"பசு",u"தோல்"], [u"பசுத்",u"தோல்"]),
    ([u"பசு",u"யாகம்"], [u"பசு",u"யாகம்"]),
    ([u"உறு",u"தெரியாமல்"], [u"உறுத்",u"தெரியாமல்"]),
    ([u"பாகு",u"காய்ச்சினாள்"], [u"பாகு",u"காய்ச்சினாள்"])
    
])

def test_va_rule_3_cases(wordPairList3, expected3):
    assert VA_Rule_3(wordPairList3) == expected3

@pytest.mark.parametrize("wordPairList4, expected4", [
    ([u"நாயை",u"பிடி"], [u"நாயைப்",u"பிடி"]),
    ([u"தாயை",u"மதித்தாள்"], [u"தாயை",u"மதித்தாள்"]),
    ([u"அவருக்கு",u"கொடுத்தாள்"], [u"அவருக்குக்",u"கொடுத்தாள்"]),
    ([u"அவளுக்கு",u"வேண்டும்"], [u"அவளுக்கு",u"வேண்டும்"]),
    ([u"அவனை",u"பார்"], [u"அவனைப்",u"பார்"]),
    ([u"அவரை",u"நினைத்தேன்"], [u"அவரை",u"நினைத்தேன்"]),
    ([u"கடைக்கு",u"போனார்"], [u"கடைக்குப்",u"போனார்"]),
    ([u"திரைக்கு",u"வேண்டும்"], [u"திரைக்கு",u"வேண்டும்"])
])

def test_va_rule_4_cases(wordPairList4, expected4):
    assert VA_Rule_4(wordPairList4) == expected4

@pytest.mark.parametrize("wordPairList5, expected5", [
    ([u"போய்",u"கூறினான்"], [u"போய்க்",u"கூறினான்"]),
    ([u"போய்",u"முயற்சித்தார்"], [u"போய்",u"முயற்சித்தார்"]),
    ([u"என",u"தெரிவித்தார்"], [u"எனத்",u"தெரிவித்தார்"]),
    ([u"என",u"விளக்கினார்"], [u"என",u"விளக்கினார்"]),
    ([u"வந்ததாய்",u"கூறினான்"], [u"வந்ததாய்க்",u"கூறினான்"]),
    ([u"வந்ததாய்",u"அறிவித்தார்"], [u"வந்ததாய்",u"அறிவித்தார்"]),
    ([u"வர",u"வேண்டும்"], [u"வர",u"வேண்டும்"]),
    ([u"வர",u"சொன்னார்"], [u"வரச்",u"சொன்னார்"]),
    ([u"கூறி",u"முடித்தார்"], [u"கூறி",u"முடித்தார்"]),
    ([u"கூறி",u"காதலித்தார்"], [u"கூறிக்",u"காதலித்தார்"]),
    ([u"இருப்தாக",u"கூறினாள்"], [u"இருப்தாகக்",u"கூறினாள்"]),
    ([u"இருப்தாக",u"முயல்கிறார்"], [u"இருப்தாக",u"முயல்கிறார்"]),
    ([u"வந்ததென",u"கூறினாள்"], [u"வந்ததெனக்",u"கூறினாள்"]),
    ([u"வந்ததென",u"நிம்மதியடைந்தார்"], [u"வந்ததென",u"நிம்மதியடைந்தார்"])
])

def test_va_rule_5_cases(wordPairList5, expected5):
    assert VA_Rule_5(wordPairList5) == expected5

@pytest.mark.parametrize("wordPairList6, expected6", [
    ([u"ஓடா",u"குதிரைகள்"], [u"ஓடாக்",u"குதிரைகள்"]),
    ([u"ஓடா",u"மாணவர்கள்"], [u"ஓடா",u"மாணவர்கள்"]),
    ([u"அறியா",u"பிள்ளைகள்"], [u"அறியாப்",u"பிள்ளைகள்"]),
    ([u"அறியா",u"இச்சைகள்"], [u"அறியா",u"இச்சைகள்"]),
    ([u"ஓடா",u"குதிரைகள்"], [u"ஓடாக்",u"குதிரைகள்"])
])

def test_va_rule_6_cases(wordPairList6, expected6):
    assert VA_Rule_6(wordPairList6) == expected6

@pytest.mark.parametrize("wordPairList7, expected7", [
    ([u"ஆ",u"கத்தியது"], [u"ஆக்",u"கத்தியது"]),
    ([u"ஆ",u"நின்றது"], [u"ஆ",u"நின்றது"]),
    ([u"ஈ",u"மிதந்தது"], [u"ஈ",u"மிதந்தது"]),
    ([u"ஈ",u"கிடந்தது"], [u"ஈக்",u"கிடந்தது"]),
    ([u"கா",u"கரைந்தது"], [u"காக்",u"கரைந்தது"]),
    ([u"கா",u"நின்றது"], [u"கா",u"நின்றது"]),
    ([u"ஊ",u"கொடு"], [u"ஊக்",u"கொடு"]),
    ([u"ஊ",u"விற்றான்"], [u"ஊ",u"விற்றான்"]),
    ([u"ஏ",u"எய்தாள்"], [u"ஏ",u"எய்தாள்"]),
    ([u"ஏ",u"தந்தான்"], [u"ஏத்",u"தந்தான்"]),
    ([u"ஐ",u"வந்தான்"], [u"ஐ",u"வந்தான்"]),
    ([u"ஐ",u"தந்தான்"], [u"ஐத்",u"தந்தான்"]),
    ([u"ஓ",u"இருந்தது"], [u"ஓ",u"இருந்தது"]),
    ([u"ஓ",u"தந்தார்"], [u"ஓத்",u"தந்தார்"]),
    ([u"கூ",u"சுழலும்"], [u"கூச்",u"சுழலும்"]),
    ([u"கூ",u"ரேகை"], [u"கூ",u"ரேகை"]),
    ([u"கை",u"கழுவினான்"], [u"கைக்",u"கழுவினான்"]),
    ([u"கை",u"ரேகை"], [u"கை",u"ரேகை"]),
    ([u"கோ",u"வென்றார்"], [u"கோ",u"வென்றார்"]),
    ([u"கோ",u"கொன்றான்"], [u"கோக்",u"கொன்றான்"]),
    ([u"சா",u"வென்றார்"], [u"சா",u"வென்றார்"]),
    ([u"சா",u"போனார்"], [u"சாப்",u"போனார்"]),
    ([u"சீ",u"என்றார்"], [u"சீ",u"என்றார்"]),
    ([u"சீ",u"திட்டினார்"], [u"சீத்",u"திட்டினார்"]),
    ([u"சே",u"என்றார்"], [u"சே",u"என்றார்"]),
    ([u"சே",u"தொடங்கும்"], [u"சேத்",u"தொடங்கும்"]),
    ([u"சோ",u"இருக்கும்"], [u"சோ",u"இருக்கும்"]),
    ([u"சோ",u"சுவர்"], [u"சோச்",u"சுவர்"]),   
    ([u"தீ",u"பிடித்தது"], [u"தீப்",u"பிடித்தது"]),
    ([u"தீ",u"நீக்கம்"], [u"தீ",u"நீக்கம்"]),
    ([u"தூ",u"செய்"], [u"தூச்",u"செய்"]),
    ([u"தூ",u"இருந்தது"], [u"தூ",u"இருந்தது"]),
    ([u"தே",u"கொடை"], [u"தேக்",u"கொடை"]),
    ([u"தே",u"இல்லை"], [u"தே",u"இல்லை"]), 
    ([u"தை",u"திருநாள்"], [u"தைத்",u"திருநாள்"]),
    ([u"தை",u"முதல்"], [u"தை",u"முதல்"]),
    ([u"பா",u"பாடினான்"], [u"பாப்",u"பாடினான்"]),
    ([u"பா",u"எழுது"], [u"பா",u"எழுது"]),
    ([u"பூ",u"சூடினாள்"], [u"பூச்",u"சூடினாள்"]),
    ([u"பூ",u"மலரும்"], [u"பூ",u"மலரும்"]),
    ([u"பே",u"கறுத்தது"], [u"பேக்",u"கறுத்தது"]),
    ([u"பே",u"மிதந்தது"], [u"பே",u"மிதந்தது"]),
    ([u"பை",u"எடு"], [u"பை",u"எடு"]),
    ([u"பை",u"தைத்தாள்"], [u"பைத்",u"தைத்தாள்"]),
    ([u"நா",u"சுழற்சி"], [u"நாச்",u"சுழற்சி"]),
    ([u"நா",u"வீங்கியது"], [u"நா",u"வீங்கியது"]),
    ([u"நே",u"பெருகியது"], [u"நேப்",u"பெருகியது"]),
    ([u"நே",u"உடையவன்"], [u"நே",u"உடையவன்"]),
    ([u"நை",u"நீங்கியது"], [u"நை",u"நீங்கியது"]),
    ([u"நை",u"பாதை"], [u"நைப்",u"பாதை"]),
    ([u"நோ",u"நீங்கியது"], [u"நோ",u"நீங்கியது"]),
    ([u"நோ",u"காலம்"], [u"நோக்",u"காலம்"]),
    ([u"மா",u"மரம்"], [u"மா",u"மரம்"]),
    ([u"மா",u"கீற்று"], [u"மாக்",u"கீற்று"]),
    ([u"மீ",u"மேகங்கள்"], [u"மீ",u"மேகங்கள்"]),
    ([u"மீ",u"தாண்டவம்"], [u"மீத்",u"தாண்டவம்"]),
    ([u"மூ",u"அடைந்தார்"], [u"மூ",u"அடைந்தார்"]),
    ([u"மூ",u"கடினங்கள்"], [u"மூக்",u"கடினங்கள்"]),
    ([u"மை",u"இட்டாள்"], [u"மை",u"இட்டாள்"]),
    ([u"மை",u"கிண்ணம்"], [u"மைக்",u"கிண்ணம்"]),
    ([u"மே",u"மாதம்"],[u"மே",u"மாதம்"]),
    ([u"மோ",u"விடு"], [u"மோ",u"விடு"]),
    ([u"யா",u"கால்"], [u"யாக்",u"கால்"]),
    ([u"யா",u"அளந்தார்"],[u"யா",u"அளந்தார்"]),
    ([u"வா",u"என்றார்"], [u"வா",u"என்றார்"]),
    ([u"வீ",u"மலர்ந்தது"],[u"வீ",u"மலர்ந்தது"]),
    ([u"வீ",u"கடை"],[u"வீக்",u"கடை"]),
    ([u"வை",u"கூடை"],[u"வைக்",u"கூடை"]),
    ([u"வை",u"மூடை"],[u"வை",u"மூடை"]),
    ([u"வெள",u"மேடை"],[u"வெள",u"மேடை"]),
    ([u"நொ",u"வந்தது"],[u"நொ",u"வந்தது"]),
    ([u"நொ",u"தீயது"],[u"நொத்",u"தீயது"]),
    ([u"து",u"என்றாள்"],[u"து",u"என்றாள்"]),
    ([u"து",u"குழம்பு"],[u"துக்",u"குழம்பு"])

])

def test_va_rule_7_cases(wordPairList7, expected7):
    assert VA_Rule_7(wordPairList7) == expected7

@pytest.mark.parametrize("wordPairList8, expected8", [
    ([u"அத்துணை",u"பெரிது"], [u"அத்துணைப்",u"பெரிது"]),
    ([u"அத்துணை",u"வலியது"], [u"அத்துணை",u"வலியது"]),
    ([u"எத்துணை",u"சிறிது"], [u"எத்துணைச்",u"சிறிது"]),
    ([u"எத்துணை",u"மென்மை"], [u"எத்துணை",u"மென்மை"]),
    ([u"இத்துணை",u"காதலா?"], [u"இத்துணைக்",u"காதலா?"]),
    ([u"இத்துணை",u"மாயமா?"], [u"இத்துணை",u"மாயமா?"])
])

def test_va_rule_8_cases(wordPairList8, expected8):
    assert VA_Rule_8(wordPairList8) == expected8

@pytest.mark.parametrize("wordPairList9, expected9", [
    ([u"பாம்பு",u"மெல்லியது"], [u"பாம்பு",u"மெல்லியது"]),
    ([u"பாம்பு",u"தோல்"], [u"பாம்புத்",u"தோல்"]),
    ([u"மருந்து",u"கடை"], [u"மருந்துக்",u"கடை"]),
    ([u"மருந்து",u"மாத்திரை"], [u"மருந்து",u"மாத்திரை"]),
    ([u"சங்கு",u"மீன்"], [u"சங்கு",u"மீன்"]),
    ([u"சங்கு",u"கழுத்து"], [u"சங்குக்",u"கழுத்து"]),
    ([u"அன்பு",u"கருவி"], [u"அன்புக்",u"கருவி"]),
    ([u"அன்பு",u"வெல்லும்"], [u"அன்பு",u"வெல்லும்"]),
    ([u"பந்து",u"இல்லை"], [u"பந்து",u"இல்லை"])

])

def test_va_rule_9_cases(wordPairList9, expected9):
    assert VA_Rule_9(wordPairList9) == expected9

@pytest.mark.parametrize("wordPairList10, expected10", [
    ([u"வரகு",u"கடை"], [u"வரகுக்",u"கடை"]),
    ([u"வரகு",u"மாளிகை"], [u"வரகு",u"மாளிகை"]),
    ([u"முதுகு",u"தண்டு"], [u"முதுகுத்",u"தண்டு"]),
    ([u"முதுகு",u"வலி"], [u"முதுகு",u"வலி"]),
    ([u"அரசு",u"உதவி"], [u"அரசு",u"உதவி"]),
    ([u"அரசு",u"பணியாளர்"], [u"அரசுப்",u"பணியாளர்"]),
    ([u"தகடு",u"குவியல்"], [u"தகடுக்",u"குவியல்"]),
    ([u"தகடு",u"இருந்தது"], [u"தகடு",u"இருந்தது"]),
    ([u"புது",u"பொருள்"], [u"புதுப்",u"பொருள்"]),
    ([u"புது",u"வீடு"], [u"புது",u"வீடு"]),
    ([u"கயிறு",u"போட்டி"], [u"கயிறுப்",u"போட்டி"]),
    ([u"கயிறு",u"நகர்ந்தது"], [u"கயிறு",u"நகர்ந்தது"]),
    ([u"கயிறு",u"போட்டி"], [u"கயிறுப்",u"போட்டி"]),
    ([u"திரிபு",u"வாதம்"], [u"திரிபு",u"வாதம்"]),
    ([u"திரிபு",u"கூற்று"], [u"திரிபுக்",u"கூற்று"])


])

def test_va_rule_10_cases(wordPairList10, expected10):
    assert VA_Rule_10(wordPairList10) == expected10

@pytest.mark.parametrize("wordPairList11, expected11", [
    ([u"சால",u"சிறந்தது"], [u"சாலச்",u"சிறந்தது"]),
    ([u"சால",u"மாண்பு"], [u"சால",u"மாண்பு"]),
    ([u"உறு",u"கொண்ட"], [u"உறுக்",u"கொண்ட"]),
    ([u"உறு",u"வலி"], [u"உறு",u"வலி"]),
    ([u"தவ",u"பெரியது"], [u"தவப்",u"பெரியது"]),
    ([u"தவ",u"மென்மை"], [u"தவ",u"மென்மை"]),
    ([u"நனி",u"கடிது"], [u"நனிக்",u"கடிது"]),
    ([u"நனி",u"மேன்மை"], [u"நனி",u"மேன்மை"]),
    ([u"கூர்",u"பொருள்"], [u"கூர்ப்",u"பொருள்"]),
    ([u"கூர்",u"மிகு"], [u"கூர்",u"மிகு"]),
    ([u"கழி",u"கடல்"], [u"கழிக்",u"கடல்"]),
    ([u"கழி",u"மிதவை"], [u"கழி",u"மிதவை"]),
    ([u"கடி",u"போட்டி"], [u"கடிப்",u"போட்டி"]),
    ([u"கடி",u"நன்மை"], [u"கடி",u"நன்மை"])


])

def test_va_rule_11_cases(wordPairList11, expected11):
    assert VA_Rule_11(wordPairList11) == expected11

@pytest.mark.parametrize("wordPairList12, expected12", [
    ([u"வடக்கு",u"மலர்"], [u"வடக்கு",u"மலர்"]),
    ([u"வடக்கு",u"திசை"], [u"வடக்குத்",u"திசை"]),
    ([u"கிழக்கு",u"திசை"], [u"கிழக்குத்",u"திசை"]),
    ([u"கிழக்கு",u"நூல்"], [u"கிழக்கு",u"நூல்"]),
    ([u"தெற்கு",u"காற்று"], [u"தெற்குக்",u"காற்று"]),
    ([u"தெற்கு",u"வரவு"], [u"தெற்கு",u"வரவு"]),
    ([u"மேற்கு",u"பறவை"], [u"மேற்குப்",u"பறவை"]),
    ([u"மேற்கு",u"வறட்சி"], [u"மேற்கு",u"வறட்சி"]),
    ([u"தென்மேற்கு",u"பருவமழை"], [u"தென்மேற்குப்",u"பருவமழை"]),
    ([u"தென்மேற்கு",u"மழை"], [u"தென்மேற்கு",u"மழை"]),
    ([u"தென்கிழக்கு",u"கடல்"], [u"தென்கிழக்குக்",u"கடல்"]),
    ([u"தென்கிழக்கு",u"மிதவை"], [u"தென்கிழக்கு",u"மிதவை"]),
    ([u"வடகிழக்கு",u"பயணம்"], [u"வடகிழக்குப்",u"பயணம்"]),
    ([u"வடகிழக்கு",u"யாத்திரை"], [u"வடகிழக்கு",u"யாத்திரை"]),
    ([u"வடமேற்கு",u"பருவக்காற்று"], [u"வடமேற்குப்",u"பருவக்காற்று"]),
    ([u"வடமேற்கு",u"மாநிலம்"], [u"வடமேற்கு",u"மாநிலம்"])
])

def test_va_rule_12_cases(wordPairList12, expected12):
    assert VA_Rule_12(wordPairList12) == expected12