import sys
import os
sys.path.insert(0, os.path.abspath(os.path.join(os.path.dirname(__file__), '..')))
import pytest
from TamilSandhi.rules.vallinam_deletion import VD_Rule_1, VD_Rule_2, VD_Rule_3, VD_Rule_4, VD_Rule_5, VD_Rule_6, VD_Rule_7, VD_Rule_8

@pytest.mark.parametrize("wordPairList1, expected1", [
    ([u"யாதுப்",u"பெரிது"], [u"யாது",u"பெரிது"]),
    ([u"இவைப்",u"போயின"], [u"இவை",u"போயின"]),
    ([u"அதுப்",u"போனது"], [u"அது",u"போனது"]),
    ([u"இதுத்",u"தேவையா?"], [u"இது",u"தேவையா?"]),
    ([u"எதுப்",u"போதாது?"], [u"எது",u"போதாது?"]),
    ([u"அவைப்",u"போதுமா?"], [u"அவை",u"போதுமா?"]),
    ([u"எவைப்",u"போயின?"], [u"எவை",u"போயின?"]),
    ([u"அன்றுப்",u"பார்த்தாயா?"], [u"அன்று",u"பார்த்தாயா?"]),
    ([u"இன்றுச்",u"சென்றாள்"], [u"இன்று",u"சென்றாள்"]),
    ([u"என்றுத்",u"தங்கினாய்?"], [u"என்று",u"தங்கினாய்?"]),
    ([u"அத்தனைக்",u"காதல்"], [u"அத்தனை",u"காதல்"]),
    ([u"இத்தனைச்",u"செல்வாக்கு"], [u"இத்தனை",u"செல்வாக்கு"]),
    ([u"எத்தனைச்",u"சிக்கல்கள்"], [u"எத்தனை",u"சிக்கல்கள்"]),
    ([u"அவ்வளவுக்",u"காடுகள்"], [u"அவ்வளவு",u"காடுகள்"]),
    ([u"இவ்வளவுச்",u"சாதனைகள்"], [u"இவ்வளவு",u"சாதனைகள்"]),
    ([u"எவ்வளவுத்",u"திட்டங்கள்?"], [u"எவ்வளவு",u"திட்டங்கள்?"]),
    ([u"அவ்வாறுப்",u"பாதித்தது"], [u"அவ்வாறு",u"பாதித்தது"]),
    ([u"இவ்வாறுக்",u"கிறுக்காதே!"], [u"இவ்வாறு",u"கிறுக்காதே!"]),
    ([u"எவ்வாறுத்",u"திட்டினாள்?"], [u"எவ்வாறு",u"திட்டினாள்?"]),
    ([u"ஒருப்",u"பானை"], [u"ஒரு",u"பானை"]),
    ([u"இருத்",u"தொட்டிகள்"], [u"இரு",u"தொட்டிகள்"]),
    ([u"அறுக்",u"கோணங்கள்"], [u"அறு",u"கோணங்கள்"],),
    ([u"எழுச்",u"சின்னங்கள்"], [u"எழு",u"சின்னங்கள்"]),
    ([u"ஒன்றுச்",u"சொன்னானா?"], [u"ஒன்று",u"சொன்னானா?"]),
    ([u"இரண்டுப்",u"புழுக்கள்"], [u"இரண்டு",u"புழுக்கள்"]),
    ([u"மூன்றுக்",u"கோடாரிகள்"], [u"மூன்று",u"கோடாரிகள்"]),
    ([u"நான்குப்",u"பதக்கங்கள்"], [u"நான்கு",u"பதக்கங்கள்"]),
    ([u"ஐந்துப்",u"புறாக்கள்"], [u"ஐந்து",u"புறாக்கள்"]),
    ([u"ஆறுக்",u"கதாநாயாகர்கள்"], [u"ஆறு",u"கதாநாயாகர்கள்"]),
    ([u"ஏழுச்",u"சித்திரங்கள்"], [u"ஏழு",u"சித்திரங்கள்"]),
    ([u"ஒன்பதுத்",u"தாவரங்கள்"], [u"ஒன்பது",u"தாவரங்கள்"]),
    ([u"நீக்",u"கூப்பிடு"], [u"நீ",u"கூப்பிடு"]),
    ([u"பலச்",u"சட்டங்கள்"], [u"பல",u"சட்டங்கள்"]),
    ([u"சிலக்",u"கொஞ்சல்கள்"], [u"சில",u"கொஞ்சல்கள்"])

])
def test_vd_rule_1_cases(wordPairList1, expected1):
    assert VD_Rule_1(wordPairList1) == expected1

@pytest.mark.parametrize("wordPairList2, expected2", [
    ([u"தம்பியால்க்",u"கெட்டான்"], [u"தம்பியால்",u"கெட்டான்"]),
    ([u"தம்பியான்க்",u"கேடு"], [u"தம்பியான்",u"கேடு"]),
    ([u"அவளோடுப்",u"போனது"], [u"அவளோடு",u"போனது"]),
    ([u"இவனொடுக்",u"காதலா?"], [u"இவனொடு",u"காதலா?"]),
    ([u"எதில்ப்",u"பாத்தாய்?"], [u"எதில்",u"பாத்தாய்?"]),
    ([u"அவரின்க்",u"குறைபாடுகள்"], [u"அவரின்",u"குறைபாடுகள்"]),
    ([u"எனதுப்",u"பையன்"], [u"எனது",u"பையன்"]),
    ([u"எனாதுக்",u"கைகள்"], [u"எனாது",u"கைகள்"])

])
def test_vd_rule_2_cases(wordPairList2, expected2):
    assert VD_Rule_2(wordPairList2) == expected2

@pytest.mark.parametrize("wordPairList3, expected3", [
    ([u"வாழ்கக்",u"காதல்"], [u"வாழ்க",u"காதல்"]),
    ([u"வாழியப்",u"பொதுமக்கள்"], [u"வாழிய",u"பொதுமக்கள்"]),
    ([u"வாழியர்த்",u"தோழி"], [u"வாழியர்",u"தோழி"])

])
def test_vd_rule_3_cases(wordPairList3, expected3):
    assert VD_Rule_3(wordPairList3) == expected3

@pytest.mark.parametrize("wordPairList4, expected4", [
    
    ([u"செய்துத்",u"தந்தார்"], [u"செய்து",u"தந்தார்"]),
    ([u"வந்துச்",u"சென்றார்"], [u"வந்து",u"சென்றார்"]),
    ([u"கண்டுப்",u"பேசினார்"], [u"கண்டு",u"பேசினார்"]),
    ([u"மாறும்படிப்",u"பேசினார்"], [u"மாறும்படி",u"பேசினார்"]),
    ([u"வருமாறுச்",u"சொன்னார்"], [u"வருமாறு",u"சொன்னார்"]),
    ([u"என்றுத்",u"தயாராகும்"], [u"என்று",u"தயாராகும்"])
])
def test_vd_rule_4_cases(wordPairList4, expected4):
    assert VD_Rule_4(wordPairList4) == expected4

@pytest.mark.parametrize("wordPairList5, expected5", [
    
    ([u"நீயாப்",u"பேசினாய்"], [u"நீயா",u"பேசினாய்"]),
    ([u"அவனாத்",u"தேடினான்?"], [u"அவனா",u"தேடினான்?"]),
    ([u"அவனோக்",u"கேட்டான்?"], [u"அவனோ",u"கேட்டான்?"])
])
def test_vd_rule_5_cases(wordPairList5, expected5):
    assert VD_Rule_5(wordPairList5) == expected5

@pytest.mark.parametrize("wordPairList6, expected6", [
    
    ([u"எஃகுக்",u"கூர்மை"], [u"எஃகு",u"கூர்மை"]),
    ([u"மார்புப்",u"பெரிது"], [u"மார்பு",u"பெரிது"]),
    ([u"எய்துக்",u"கேட்டான்"], [u"எய்து",u"கேட்டான்"]),
    ([u"நல்குப்",u"கேட்டான்"], [u"நல்கு",u"கேட்டான்"])
])
def test_vd_rule_6_cases(wordPairList6, expected6):
    assert VD_Rule_6(wordPairList6) == expected6

@pytest.mark.parametrize("wordPairList7, expected7", [
    
    ([u"பாம்புப்",u"பாம்பு"], [u"பாம்பு",u"பாம்பு"]),
    ([u"பளப்",u"பள"], [u"பள",u"பள"]),
    ([u"சிலச்",u"சில"], [u"சில",u"சில"]),
    ([u"தளத்",u"தள"], [u"தள",u"தள"]),
    ([u"கடக்",u"கட"], [u"கட",u"கட"])
])
def test_vd_rule_7_cases(wordPairList7, expected7):
    assert VD_Rule_7(wordPairList7) == expected7

@pytest.mark.parametrize("wordPairList8, expected8", [
    
    (['நான்', 'அந்த', 'பயிற்ச்சி', 'பெற்றேன்'], "நான் அந்த பயிற்சி பெற்றேன்"),
    (['மலரில்', 'முட்க்கள்', 'இருந்தன'], "மலரில் முட்கள் இருந்தன")
])
def test_vd_rule_8_cases(wordPairList8, expected8):
    assert VD_Rule_8(wordPairList8) == expected8