KEYS_FOR_PORTFOLIO = ["일자", "자산", "종목", "종목명", "원화 보유정보: 수량", "원화 보유정보: 장부가액", "원화 보유정보: 평가액", "비중: 자산대비", "비중: 시장비중"]

COLUMNS_FOR_PORTFOLIO = ["자산", "종목", "종목명", "비중: 자산대비", "원화 보유정보: 수량", "원화 보유정보: 장부가액", "원화 보유정보: 평가액", "비중: 시장비중", "원화 보유정보: 총평가손익률", "종목정보: 업종구분/보증기관"]
COLS_RENAMED = ["자산", "종목", "종목명", "비중", "수량", "장부가", "평가액", "시장비중", "총평가손익률", "업종구분/보증기관"]
MAPPING_COLS = dict(zip(COLUMNS_FOR_PORTFOLIO, COLS_RENAMED))

COLUMNS_FOR_STOCK = ["자산", "종목", "종목명", "비중: 자산대비", "원화 보유정보: 수량", "원화 보유정보: 장부가액", "원화 보유정보: 평가액", "원화 보유정보: 총평가손익률", "자산정보: 시가총액", "종목정보: 업종구분/보증기관"]
COLS_RENAMED_STOCK = ["자산", "종목", "종목명", "비중", "수량", "장부가", "평가액", "총평가손익률", "시가총액", "업종구분/보증기관"]
MAPPING_COLS_STOCK = dict(zip(COLUMNS_FOR_STOCK, COLS_RENAMED_STOCK))

COLUMNS_FOR_ETF = ["자산", "종목", "종목명", "비중: 자산대비", "원화 보유정보: 수량", "원화 보유정보: 장부가액", "원화 보유정보: 평가액", "원화 보유정보: 총평가손익률", "자산정보: 시가총액", "종목정보: 업종구분/보증기관"]
COLS_RENAMED_ETF = ["자산", "종목", "종목명", "비중", "수량", "장부가", "평가액", "총평가손익률", "시가총액", "업종구분/보증기관"]
MAPPING_COLS_ETF = dict(zip(COLUMNS_FOR_ETF, COLS_RENAMED_ETF))

COLUMNS_FOR_BOND = ["자산", "종목", "종목명", "비중: 자산대비", "원화 보유정보: 장부가액", "원화 보유정보: 평가액", "원화 보유정보: 미수이자", "원화 보유정보: 총평가손익률", "종목정보: 편입일", "종목정보: 잔존일수", "종목정보: 발행기관", "종목정보: 신용등급"]
COLS_RENAMED_BOND = ["자산", "종목", "종목명", "비중", "장부가", "평가액", "미수이자", "총평가손익률", "편입일", "잔존일수", "발행기관", "신용등급"]
MAPPING_COLS_BOND = dict(zip(COLUMNS_FOR_BOND, COLS_RENAMED_BOND))

COLUMNS_FOR_FUTURES = ["자산", "종목", "종목명", "비중: 자산대비", "원화 보유정보: 수량", "원화 보유정보: 장부가액", "원화 보유정보: 평가액", "원화 보유정보: 총평가손익률", "종목정보: 잔존일수", "종목정보: 발행국가"]
COLS_RENAMED_FUTURES = ["자산", "종목", "종목명", "비중", "수량", "장부가", "평가액", "총평가손익률", "잔존일수", "발행국가"]
MAPPING_COLS_FUTURES = dict(zip(COLUMNS_FOR_FUTURES, COLS_RENAMED_FUTURES))

COLUMNS_FOR_TRS = ["자산", "종목", "종목명", "비중: 자산대비", "원화 보유정보: 수량", "원화 보유정보: 평가손익", "종목정보: 편입일", "종목정보: 잔존일수", "자산정보: TICKER"]
COLS_RENAMED_TRS = ["자산", "종목", "종목명", "비중", "수량", "평가손익", "편입일", "잔존일수", "TICKER"]
MAPPING_COLS_TRS = dict(zip(COLUMNS_FOR_TRS, COLS_RENAMED_TRS))

VALID_ASSETS = ['국내주식', '국내채권', '국내선물', '국내수익증권', '국내수익증권(ETF)', '외화주식', '외화스왑', '외화선물']
COLUMNS_FOR_PORTFOLIO_SNAPSHOT = ["펀드코드", "자산", "종목", "종목명", "원화 보유정보: 수량", "원화 보유정보: 장부가액", "원화 보유정보: 평가액", "비중: 자산대비", "비중: 시장비중"]
