import tamil
import unicodedata
Migaa_words_list=[u'யாது',u'அது',u'இது',u'எது',u'அவை',u'இவை',u'எவை',u'அன்று',u'இன்று',u'என்று',u'அத்தனை',u'எத்தனை',u'இத்தனை',u'அவ்வளவு',u'இவ்வளவு',u'எவ்வளவு',u'அவ்வாறு',u'இவ்வாறு',u'எவ்வாறு',u'ஒரு',u'இரு',u'அறு',u'எழு',u'ஒன்று',u'இரண்டு',u'மூன்று',u'நான்கு',u'ஐந்து',u'ஆறு',u'ஏழு',u'ஒன்பது',u'நீ',u'பல',u'சில']

oreluthuOrumozhi = [u"ஆ",u"ஈ",u"ஊ",u"ஏ",u"ஐ",u"ஓ",u"மா",u"மீ",u"மூ",u"மே",u"மை",u"மோ",u"தா",u"தீ",u"தூ",u"தே",u"தை",u"பா",u"பூ",u"பே",u"பை",u"போ",u"நா",u"நீ",u"நே",u"நை",u"நோ",u"கா",u"கூ",u"கை",u"கோ",u"வா",u"வீ",u"வை",u"வெள",u"சா",u"சீ",u"சே",u"சோ",u"யா",u"நொ",u"து"]

UyirMei_dict = {u'க':[u'க்','அ'],u'கா':[u'க்','ஆ'],u'கி':[u'க்','இ'],u'கீ':[u'க்','ஈ'],u'கு':[u'க்','உ'],u'கூ':[u'க்','ஊ'],u'கெ':[u'க்','எ'],u'கே':[u'க்','ஏ'],u'கை':[u'க்','ஐ'],u'கொ':[u'க்','ஒ'],u'கோ':[u'க்','ஓ'],u'கௌ':[u'க்','ஔ'],
                u'ங':[u'ங்','அ'],u'ஙா':[u'ங்','ஆ'],u'ஙி':[u'ங்','இ'],u'ஙீ':[u'ங்','ஈ'],u'ஙு':[u'ங்','உ'],u'ஙூ':[u'ங்','ஊ'],u'ஙெ':[u'ங்','எ'],u'ஙே':[u'ங்','ஏ'],u'ஙை':[u'ங்','ஐ'],u'ஙொ':[u'ங்','ஒ'],u'ஙோ':[u'ங்','ஓ'],u'ஙௌ':[u'ங்','ஔ'],
                u'ச':[u'ச்','அ'],u'சா':[u'ச்','ஆ'],u'சி':[u'ச்','இ'],u'சீ':[u'ச்','ஈ'],u'சு':[u'ச்','உ'],u'சூ':[u'ச்','ஊ'],u'செ':[u'ச்','எ'],u'சே':[u'ச்','ஏ'],u'சை':[u'ச்','ஐ'],u'சொ':[u'ச்','ஒ'],u'சோ':[u'ச்','ஓ'],u'சௌ':[u'ச்','ஔ'],
                u'ஞ':[u'ஞ்','அ'],u'ஞா':[u'ஞ்','ஆ'],u'ஞி':[u'ஞ்','இ'],u'ஞீ':[u'ஞ்','ஈ'],u'ஞு':[u'ஞ்','உ'],u'ஞூ':[u'ஞ்','ஊ'],u'ஞெ':[u'ஞ்','எ'],u'ஞே':[u'ஞ்','ஏ'],u'ஞை':[u'ஞ்','ஐ'],u'ஞொ':[u'ஞ்','ஒ'],u'ஞோ':[u'ஞ்','ஓ'],u'ஞௌ':[u'ஞ்','ஔ'],
                u'ட':[u'ட்','அ'],u'டா':[u'ட்','ஆ'],u'டி':[u'ட்','இ'],u'டீ':[u'ட்','ஈ'],u'டு':[u'ட்','உ'],u'டூ':[u'ட்','ஊ'],u'டெ':[u'ட்','எ'],u'டே':[u'ட்','ஏ'],u'டை':[u'ட்','ஐ'],u'டொ':[u'ட்','ஒ'],u'டோ':[u'ட்','ஓ'],u'டௌ':[u'ட்','ஔ'],
                u'ண':[u'ண்','அ'],u'ணா':[u'ண்','ஆ'],u'ணி':[u'ண்','இ'],u'ணீ':[u'ண்','ஈ'],u'ணு':[u'ண்','உ'],u'ணூ':[u'ண்','ஊ'],u'ணெ':[u'ண்','எ'],u'ணே':[u'ண்','ஏ'],u'ணை':[u'ண்','ஐ'],u'ணொ':[u'ண்','ஒ'],u'ணோ':[u'ண்','ஓ'],u'ணௌ':[u'ண்','ஔ'],
                u'த':[u'த்','அ'],u'தா':[u'த்','ஆ'],u'தி':[u'த்','இ'],u'தீ':[u'த்','ஈ'],u'து':[u'த்','உ'],u'தூ':[u'த்','ஊ'],u'தெ':[u'த்','எ'],u'தே':[u'த்','ஏ'],u'தை':[u'த்','ஐ'],u'தொ':[u'த்','ஒ'],u'தோ':[u'த்','ஓ'],u'தௌ':[u'த்','ஔ'],
                u'ந':[u'ந்','அ'],u'நா':[u'ந்','ஆ'],u'நி':[u'ந்','இ'],u'நீ':[u'ந்','ஈ'],u'நு':[u'ந்','உ'],u'நூ':[u'ந்','ஊ'],u'நெ':[u'ந்','எ'],u'நே':[u'ந்','ஏ'],u'நை':[u'ந்','ஐ'],u'நொ':[u'ந்','ஒ'],u'நோ':[u'ந்','ஓ'],u'நௌ':[u'ந்','ஔ'],
                u'ப':[u'ப்','அ'],u'பா':[u'ப்','ஆ'],u'பி':[u'ப்','இ'],u'பீ':[u'ப்','ஈ'],u'பு':[u'ப்','உ'],u'பூ':[u'ப்','ஊ'],u'பெ':[u'ப்','எ'],u'பே':[u'ப்','ஏ'],u'பை':[u'ப்','ஐ'],u'பொ':[u'ப்','ஒ'],u'போ':[u'ப்','ஓ'],u'பௌ':[u'ப்','ஔ'],
                u'ம':[u'ம்','அ'],u'மா':[u'ம்','ஆ'],u'மி':[u'ம்','இ'],u'மீ':[u'ம்','ஈ'],u'மு':[u'ம்','உ'],u'மூ':[u'ம்','ஊ'],u'மெ':[u'ம்','எ'],u'மே':[u'ம்','ஏ'],u'மை':[u'ம்','ஐ'],u'மொ':[u'ம்','ஒ'],u'மோ':[u'ம்','ஓ'],u'மௌ':[u'ம்','ஔ'],
                u'ய':[u'ய்','அ'],u'யா':[u'ய்','ஆ'],u'யி':[u'ய்','இ'],u'யீ':[u'ய்','ஈ'],u'யு':[u'ய்','உ'],u'யூ':[u'ய்','ஊ'],u'யெ':[u'ய்','எ'],u'யே':[u'ய்','ஏ'],u'யை':[u'ய்','ஐ'],u'யொ':[u'ய்','ஒ'],u'யோ':[u'ய்','ஓ'],u'யௌ':[u'ய்','ஔ'],
                u'ர':[u'ர்','அ'],u'ரா':[u'ர்','ஆ'],u'ரி':[u'ர்','இ'],u'ரீ':[u'ர்','ஈ'],u'ரு':[u'ர்','உ'],u'ரூ':[u'ர்','ஊ'],u'ரெ':[u'ர்','எ'],u'ரே':[u'ர்','ஏ'],u'ரை':[u'ர்','ஐ'],u'ரொ':[u'ர்','ஒ'],u'ரோ':[u'ர்','ஓ'],u'ரௌ':[u'ர்','ஔ'],
                u'ல':[u'ல்','அ'],u'லா':[u'ல்','ஆ'],u'லி':[u'ல்','இ'],u'லீ':[u'ல்','ஈ'],u'லு':[u'ல்','உ'],u'லூ':[u'ல்','ஊ'],u'லெ':[u'ல்','எ'],u'லே':[u'ல்','ஏ'],u'லை':[u'ல்','ஐ'],u'லொ':[u'ல்','ஒ'],u'லோ':[u'ல்','ஓ'],u'லௌ':[u'ல்','ஔ'],
                u'வ':[u'வ்','அ'],u'வா':[u'வ்','ஆ'],u'வி':[u'வ்','இ'],u'வீ':[u'வ்','ஈ'],u'வு':[u'வ்','உ'],u'வூ':[u'வ்','ஊ'],u'வெ':[u'வ்','எ'],u'வே':[u'வ்','ஏ'],u'வை':[u'வ்','ஐ'],u'வொ':[u'வ்','ஒ'],u'வோ':[u'வ்','ஓ'],u'வௌ':[u'வ்','ஔ'],
                u'ழ':[u'ழ்','அ'],u'ழா':[u'ழ்','ஆ'],u'ழி':[u'ழ்','இ'],u'ழீ':[u'ழ்','ஈ'],u'ழு':[u'ழ்','உ'],u'ழூ':[u'ழ்','ஊ'],u'ழெ':[u'ழ்','எ'],u'ழே':[u'ழ்','ஏ'],u'ழை':[u'ழ்','ஐ'],u'ழொ':[u'ழ்','ஒ'],u'ழோ':[u'ழ்','ஓ'],u'ழௌ':[u'ழ்','ஔ'],
                u'ள':[u'ள்','அ'],u'ளா':[u'ள்','ஆ'],u'ளி':[u'ள்','இ'],u'ளீ':[u'ள்','ஈ'],u'ளு':[u'ள்','உ'],u'ளூ':[u'ள்','ஊ'],u'ளெ':[u'ள்','எ'],u'ளே':[u'ள்','ஏ'],u'ளை':[u'ள்','ஐ'],u'ளொ':[u'ள்','ஒ'],u'ளோ':[u'ள்','ஓ'],u'ளௌ':[u'ள்','ஔ'],
                u'ற':[u'ற்','அ'],u'றா':[u'ற்','ஆ'],u'றி':[u'ற்','இ'],u'றீ':[u'ற்','ஈ'],u'று':[u'ற்','உ'],u'றூ':[u'ற்','ஊ'],u'றெ':[u'ற்','எ'],u'றே':[u'ற்','ஏ'],u'றை':[u'ற்','ஐ'],u'றொ':[u'ற்','ஒ'],u'றோ':[u'ற்','ஓ'],u'றௌ':[u'ற்','ஔ'],
                u'ன':[u'ன்','அ'],u'னா':[u'ன்','ஆ'],u'னி':[u'ன்','இ'],u'னீ':[u'ன்','ஈ'],u'னு':[u'ன்','உ'],u'னூ':[u'ன்','ஊ'],u'னெ':[u'ன்','எ'],u'னே':[u'ன்','ஏ'],u'னை':[u'ன்','ஐ'],u'னொ':[u'ன்','ஒ'],u'னோ':[u'ன்','ஓ'],u'னௌ':[u'ன்','ஔ']
               }

UyirMeiLetters=list(UyirMei_dict.keys())
VallinaUyirMeiLetters = UyirMeiLetters[:12]+UyirMeiLetters[24:36]+UyirMeiLetters[72:84]+UyirMeiLetters[96:108]
mei_letters = [u'க்',u'ங்',u'ச்',u'ஞ்',u'ட்',u'ண்',u'த்',u'ந்',u'ப்',u'ம்',u'ய்',u'ர்',u'ல்',u'வ்',u'ழ்',u'ள்',u'ற்',u'ன்']
uyir_letters = [u'அ',u'ஆ',u'இ',u'ஈ',u'உ',u'ஊ',u'எ',u'ஏ',u'ஐ',u'ஒ',u'ஓ',u'ஔ']
ayudha_letter = [u'ஃ']
vallinam_letters = [u'க்',u'ச்',u'ட்',u'த்',u'ப்',u'ற்']
mellinam_letters = [u'ங்',u'ஞ்',u'ண்',u'ந்',u'ம்',u'ன்']

Kuril_letters = [u'அ',u'இ',u'உ',u'எ',u'ஒ',u'க',u'கி',u'கு',u'கெ',u'கொ',u'ங',u'ஙி',u'ஙு',u'ஙெ',u'ஙொ',u'ச',u'சி',u'சு',u'செ',u'சொ',u'ஞ',u'ஞி',u'ஞு',u'ஞெ',u'ஞொ',u'ட',u'டி',u'டு',u'டெ',u'டொ',u'ண',u'ணி',u'ணு',u'ணெ',u'ணொ',u'த',u'தி',u'து',u'தெ',u'தொ',u'ந',u'நி',u'நு',u'நெ',u'நொ',u'ப',u'பி',u'பு',u'பெ',u'பொ',u'ம',u'மி',u'மு',u'மெ',u'மொ',u'ய',u'யி',u'யு',u'யெ',u'யொ',u'ர',u'ரி',u'ரு',u'ரெ',u'ரொ',u'ல',u'லி',u'லு',u'லெ',u'லொ',u'வ',u'வி',u'வு',u'வெ',u'வொ',u'ழ',u'ழி',u'ழு',u'ழெ',u'ழொ',u'ள',u'ளி',u'ளு',u'ளெ',u'ளொ',u'ற',u'றி',u'று',u'றெ',u'றொ',u'ன',u'னி',u'னு',u'னெ',u'னொ']

idaiyinam_letters = tamil.utf8.idayinam_letters
Migum_words_list = [u'அ',u'இ',u'எ',u'அந்த',u'இந்த',u'எந்த',u'அங்கு',u'இங்கு',u'எங்கு',u'ஆங்கு',u'ஈங்கு',u'யாங்கு',u'அப்படி',u'இப்படி',u'எப்படி',u'ஆண்டு',u'ஈண்டு',u'யாண்டு',u'அவ்வகை',u'இவ்வகை',u'எவ்வகை',u'இனி',u'தனி',u'அன்றி',u'இன்றி',u'மற்ற',u'மற்றை',u'அரை',u'பாதி']
Migum_words_list = [unicodedata.normalize('NFC', w) for w in Migum_words_list]
Kutriyalugaram = [u'கு',u'சு',u'டு',u'து',u'பு',u'று']
mellinam_letters = [u'ஞ்',u'ங்',u'ன்',u'ந்',u'ம்',u'ண்']
urichol = [u"சால",u"உறு",u"தவ",u"நனி",u"கூர்",u"கழி",u"கடி"]
Van_Kutriyalugaram = [u'கு',u'சு',u'டு',u'து',u'பு',u'று']
Migum_words_list2 = [u"அத்துணை",u"இத்துணை",u"எத்துணை"]
directions = [u"வடக்கு",u"கிழக்கு",u"தெற்கு",u"மேற்கு",u"தென்மேற்கு",u"தென்கிழக்கு",u"வடகிழக்கு",u"வடமேற்கு"] 
