"""
# File       : 异常管理.py
# Time       ：2024/8/29 上午8:19
# Author     ：xuewei zhang
# Email      ：shuiheyangguang@gmail.com
# version    ：python 3.12
# Description：
"""
from enum import Enum


class 其他_异常代码(int, Enum):
    数据不存在 = 7401
    新增数据失败 = 7402
    更新数据失败 = 7403
    删除数据失败 = 7404

    未知错误 = 7999
    未知异常 = 7998
    未知错误_请联系管理员 = 7997


class 订单_异常代码(int, Enum):
    订单号不存在 = 7101
    订单号已存在 = 7102
    订单状态错误 = 7103
    订单金额错误 = 7104
    订单支付失败 = 7105
    订单退款失败 = 7106
    订单查询失败 = 7107
    订单支付中 = 7108
    订单退款中 = 7109


class 商品_异常代码(int, Enum):
    商品不存在 = 7201
    商品已存在 = 7202
    商品状态错误 = 7203
    商品数量错误 = 7204
    商品价格错误 = 7205
    商品库存不足 = 7206


class 支付_异常代码(int, Enum):
    支付单号已存在 = 7301
    支付单号不存在 = 7302
    支付单状态错误 = 7303
    支付单金额错误 = 7304
    支付记录不存在 = 7305


class 用户_异常代码(int, Enum):
    用户不存在 = 7501
    用户已存在 = 7502
    用户创建失败 = 7503
    用户更新失败 = 7504
    用户删除失败 = 7505


class 支付转换权限_异常代码(int, Enum):
    支付转换权限不存在 = 7601
    支付转换权限已存在 = 7602
    支付转换权限创建失败 = 7603
    支付转换权限更新失败 = 7604
    支付转换权限删除失败 = 7605


class 促销活动_异常代码(int, Enum):
    促销活动不存在 = 7701
    促销活动已存在 = 7702
    促销活动创建失败 = 7703
    促销活动更新失败 = 7704
    促销活动删除失败 = 7705


class 优惠券_异常代码(int, Enum):
    优惠券不存在 = 7801
    优惠券已存在 = 7802
    优惠券创建失败 = 7803
    优惠券更新失败 = 7804
    优惠券删除失败 = 7805

class 用户优惠券_异常代码(int, Enum):
    用户优惠券不存在 = 7901
    用户优惠券已存在 = 7902
    用户优惠券创建失败 = 7903
    用户优惠券更新失败 = 7904
    用户优惠券删除失败 = 7905