Repository: pypi-data/pypi-mirror-373
Catalog: packages/nautilus-open-any-terminal/nautilus_open_any_terminal-0.6.2.tar.gz/nautilus_open_any_terminal-0.6.2/nautilus_open_any_terminal/locale/*.po
Languages: ar, cs, gl, sk

source: Terminal
ar: الطرفية
cs: terminál
sk: Terminál

source: Open in Remote {}
ar: افتح في {} بعيدًا
cs: Otevřít v aplikaci {} (vzdáleně)
gl: Abrir remotamente no {}
sk: Otvoriť vzdialenou aplikáciou {}

source: Open Remote {} in {}
ar: افتح {} بعيدًا في {}
cs: Otevřít aplikaci {} v {} (vzdáleně)
gl: Abrir {} remotamente no {}
sk: Otvoriť vzdialenou aplikáciou {} v {}

source: Open in Local {}
ar: افتح في {} محليًا
cs: Otevřít v aplikaci {} (lokálně)
gl: Abrir localmente no {}
sk: Otvoriť lokálou nou aplikáci{}

source: Open Local {} in {}
ar: افتح {} محليًا في {}
cs: Otevřít aplikaci {} v {} (lokálně)
gl: Abrir {} localmente no {}
sk: Otvoriť lokálnou aplikáciou {} v {}

source: Open Remote {} Here
ar: افتح {} بعيدًا هنا
cs: Otevřít zde aplikaci {} (vzdáleně)
gl: Abrir {} remotamente aquí
sk: Otvoriť vzdialenou aplikáciou {} tu

source: Open Remote {} in This Directory
ar: افتح {} بعيدًا في هذا المجلد
cs: Otevřít aplikaci {} v této složce (vzdáleně)
gl: Abrir {} remotamente neste directorio
sk: Otvoriť vzdialenou aplikáciou {} v tomto priečinku

source: Open Local {} Here
ar: افتح {} محليًا هنا
cs: Otevřít zde aplikaci {} (lokálně)
gl: Abrir {} localmente aquí
sk: Otvoriť lokálnou aplikáciou {} tu

source: Open Local {} in This Directory
ar: افتح {} محليًا في هذا المجلد
cs: Otevřít aplikaci {} v této složce (lokálně)
gl: Abrir {} localmente neste directorio
sk: Otvoriť lokálnou aplikáciou {} v tomto priečinku

source: Open in {}
ar: افتح في {}
cs: Otevřít v aplikaci {}
gl: Abrir no {}
sk: Otvoriť v {}

source: Open {} in {}
ar: افتح {} في {}
cs: Otevřít aplikaci {} v {}
gl: Abrir {} no {}
sk: Otvoriť {} v {}

source: Open {} Here
ar: افتح {} هنا
cs: Otevřít zde aplikaci {}
gl: Abrir {} aquí
sk: Otvoriť {} tu

source: Open {} in This Directory
ar: افتح {} في هذا المجلد
cs: Otevřít aplikaci {} v této složce
gl: Abrir {} neste directorio
sk: Otvoriť {} v tomto priečinku

source: Execute in Remote {}
ar: شغِّل في {} بعيدًا
cs: Spustit v aplikaci {} (vzdáleně)
gl: Executar remotamente no {}
sk: Spustiť vzdialenou aplikáciou {}

source: Execute {} in {} via SSH
ar: شغِّل {} في {} عبر SSH
cs: Spustit {} v aplikaci {} přes SSH
gl: Executar {} no {} por SSH
sk: Spustiť {} v {} cez SSH

source: Execute in Local {}
ar: شغِّل في {} محليًا
cs: Spustit v aplikaci {} (lokálně)
gl: Executar localmente no {}
sk: Spustiť lokálnou aplikáciou {}

source: Execute {} in Local {}
ar: شغِّل {} في {} محليًا
cs: Spustit {} v aplikaci {} (lokálně)
gl: Executar {} localmente no {}
sk: Spustiť {} lokálnou aplikáciou {}

source: Execute in {}
ar: شغِّل في {}
cs: Spustit v aplikaci {}
gl: Executar no {}
sk: Spustiť v {}

source: Execute {} in {}
ar: شغِّل {} في {}
cs: Spustit {} v aplikaci {}
gl: Executar {} no {}
sk: Spustiť {} v {}
